src/Enums/ТипыОбъектов/ТипыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b00d3374-fba3-4dfd-a8b9-2e9192589501">
  <name>ТипыОбъектов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="9a8e9e82-d92a-4009-b106-ec0dad7bbfdc">
    <name>БизнесПроцесс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="28f6293b-0a76-4f8d-b741-d6a86e461c95">
    <name>Булево</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c96f080e-8e03-46df-92cf-899101180ccb">
    <name>Строка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="52776854-ef3f-4d53-9b46-b1f5921f3db5">
    <name>Число</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="85dae71e-5343-4aa2-ad48-5bafd0e77bf1">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0ef44e26-9f8a-4f9f-af9f-b045c498816a">
    <name>ХранилищеЗначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="edc93a94-df17-4565-a085-b9635011d6e4">
    <name>УникальныйИдентификатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3cc366d1-dec6-4c40-bc75-a26c1cc4d307">
    <name>Перечисление</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e59131cc-796f-4a59-b508-b7116216ed5f">
    <name>ЛюбаяСсылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="61c264b5-4a1a-4a85-9134-71d05b5ef74f">
    <name>Справочник</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f39eb3b4-764d-4e49-9149-79a08def2a0e">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b3b69793-028f-4701-963c-d2e5302d5e7b">
    <name>ПланВидовРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3817b5d5-5de7-4f12-85c4-5037b01e683d">
    <name>ПланВидовХарактеристик</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e46ff655-d737-4f7e-99a8-70bdd157c150">
    <name>ПланОбмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="556282ca-df4a-4d71-b417-48193ff98076">
    <name>ПланСчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="666398bf-eff8-4172-9c11-f7e1a1382499">
    <name>ТочкаМаршрутаБизнесПроцесса</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d4ec2030-fa42-4716-a9e9-87a282796ebb">
    <name>Задача</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bf7d940d-ea2d-4e76-9a9b-17544835afee">
    <name>ВидРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b65ce0b2-9d46-44a6-8beb-4b6114c07627">
    <name>ВидСубконто</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/CommonModules/КонвертацияДанныхXDTOВызовСервера/Module.bsl
//@skip-check export-procedure-missing-comment

#Область ПрограммныйИнтерфейс

&ИзменениеИКонтроль("ЗаполнитьСписокОбъектовКонфигурации")
Процедура кфк_ЗаполнитьСписокОбъектовКонфигурации(ПолучательОбъектовКонфигурации, ДанныеФильтра, ОбластьПрименения) Экспорт
	ПолучательОбъектовКонфигурации.Очистить();
	Если НЕ ЗначениеЗаполнено(ДанныеФильтра) Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;

	Если ОбластьПрименения.ДляПРО Тогда
		Запрос.УстановитьПараметр("ПланОбмена",ДанныеФильтра.ПланОбмена);
		Запрос.УстановитьПараметр("Владелец",ДанныеФильтра.Конфигурация);

		ТекстЗапроса = "ВЫБРАТЬ
		|	СвойстваТипы.Тип                    КАК Объект,
		|	СвойстваТипы.Ссылка.Авторегистрация КАК Авторегистрация
		|ПОМЕСТИТЬ СоставПланаОбмена
		|ИЗ
		|	Справочник.Свойства.Типы КАК СвойстваТипы
		|ГДЕ
		|	  СвойстваТипы.Ссылка.Владелец.Наименование = &ПланОбмена
		|	И СвойстваТипы.Ссылка.Владелец.Владелец = &Владелец
		|	И СвойстваТипы.Ссылка.Вид      = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.ЭлементСоставаПланаОбмена)
		|;
		|
		|ВЫБРАТЬ
		|	СправочникОбъекты.Наименование КАК Наименование,
		|	СправочникОбъекты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Объекты КАК СправочникОбъекты
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	СоставПланаОбмена КАК СоставПланаОбмена
		|ПО
		|	СправочникОбъекты.Ссылка = СоставПланаОбмена.Объект
		|
		|ГДЕ
		|	НЕ СправочникОбъекты.ПометкаУдаления
		|	И СправочникОбъекты.ЭтоГруппа = ЛОЖЬ
		|	И СправочникОбъекты.Владелец = &Владелец
		|	И СправочникОбъекты.Наименование <> ""РегистрСведенийЗапись.СоответствиеОбъектовИнформационныхБаз""
		|	И НЕ СоставПланаОбмена.Объект ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	СправочникОбъекты.ЭтоГруппа ИЕРАРХИЯ,
		|	СправочникОбъекты.Наименование
		|";
	Иначе
		Если ТипЗнч(ДанныеФильтра) = Тип("СправочникСсылка.Релизы") Тогда
			Запрос.УстановитьПараметр("Конфигурация",ДанныеФильтра);
		ИначеЕсли ТипЗнч(ДанныеФильтра) = Тип("СписокЗначений") Тогда
			Запрос.УстановитьПараметр("Конфигурация",ДанныеФильтра[0].Значение);
		Иначе
			Запрос.УстановитьПараметр("Конфигурация",ДанныеФильтра[0]);
		КонецЕсли;
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Объекты.Наименование КАК Наименование,
		|	Объекты.Ссылка,
		|	Объекты.Тип КАК Тип
		|ПОМЕСТИТЬ ТаблицаОбъектов
		|ИЗ Справочник.Объекты КАК Объекты
		|ГДЕ Объекты.ПометкаУдаления = ЛОЖЬ И Объекты.ЭтоГруппа = ЛОЖЬ
		|	И Объекты.Владелец = &Конфигурация
		|#УСЛОВИЕ_ПК#
		|;
		|ВЫБРАТЬ
		|	Наименование,
		|	Ссылка
		|ИЗ ТаблицаОбъектов
		|УПОРЯДОЧИТЬ ПО Наименование";

		Если ОбластьПрименения.ДляПКПД Тогда
			ТекстУсловиеПК = "
			|	И (Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Справочник)
			|		ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Перечисление)
			|	ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланВидовРасчета)
			|		ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланСчетов)
			|		ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланВидовХарактеристик))";
		Иначе
			ТекстУсловиеПК = "И (Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Справочник)
							|	ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Документ)
							|	ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.РегистрСведений)
							|	ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.НаборКонстант)
							|	ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланСчетов)
							|	ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланВидовРасчета)
							|	ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланВидовХарактеристик))";
			#Вставка
			ТекстУсловиеПК = "И (Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Справочник)
							|	ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Документ)
							|	ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.РегистрСведений)
							|	ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.НаборКонстант)
							|	ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланСчетов)
							|	ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланВидовРасчета)
							|	ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланВидовХарактеристик)
							|	ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.БизнесПроцесс))";
			#КонецВставки
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#УСЛОВИЕ_ПК#", ТекстУсловиеПК);
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	ДобавлятьВТаблицу = Истина;
	Если ТипЗнч(ПолучательОбъектовКонфигурации) = Тип("СписокЗначений") Тогда
		ДобавлятьВТаблицу = Ложь;
	КонецЕсли;

	Пока Выборка.Следующий() Цикл
		Если ДобавлятьВТаблицу Тогда
			СтрокаОбъект = ПолучательОбъектовКонфигурации.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаОбъект, Выборка);
			СтрокаОбъект.Наименование = СокрЛП(СтрокаОбъект.Наименование);
		Иначе
			ПолучательОбъектовКонфигурации.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("ПолучитьТекстЗапросаСписокОбъектовФормата")
Функция кфк_ПолучитьТекстЗапросаСписокОбъектовФормата(СтруктураПараметров)
	ТекстЗапроса = "";
	Если СтруктураПараметров.ОтборПоКонвертациям = Истина Тогда
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|ВерсияФормата
		|ПОМЕСТИТЬ ВерсииИзКонвертаций
		|ИЗ Справочник.Конвертации.ВерсииФормата
		|ГДЕ Ссылка В (&МассивКонвертаций)
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|Расширение КАК ВерсияФормата
		|ПОМЕСТИТЬ ВерсииИзРасширений
		|ИЗ РегистрСведений.ВзаимосвязиВерсийФорматовИРасширений
		|ГДЕ ВерсияФорматаОбмена В (ВЫБРАТЬ ВерсияФормата ИЗ ВерсииИзКонвертаций)
		|;
		|";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|ОбъектыФормата.Наименование
	|ИЗ Справочник.ОбъектыФормата КАК ОбъектыФормата
	|#СОЕДИНЕНИЕ_ПК#
	|ГДЕ ОбъектыФормата.ПометкаУдаления = ЛОЖЬ И ОбъектыФормата.ЭтоГруппа = ЛОЖЬ
	|				#УсловиеВерсияФормата#
	|#УСЛОВИЕ_ПК#
	|УПОРЯДОЧИТЬ ПО ОбъектыФормата.Наименование";
	ТекстСоединениеПК = "";
	ТекстУсловиеПК = "";
	Если СтруктураПараметров.ДляПКО = Истина Тогда
		ТекстСоединениеПК = "ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ Владелец ИЗ Справочник.СвойстваФормата) КАК Свойства
		|ПО Свойства.Владелец = ОбъектыФормата.Ссылка";
		ТекстУсловиеПК = "
		|	И (ОбъектыФормата.Наименование ПОДОБНО ""Справочник.%"" ИЛИ ОбъектыФормата.Наименование ПОДОБНО ""Документ.%"")";
	ИначеЕсли СтруктураПараметров.ДляПКПД Тогда
		ТекстСоединениеПК = "ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ Владелец ИЗ Справочник.ЗначенияФормата) КАК Значения
		|ПО Значения.Владелец = ОбъектыФормата.Ссылка";
	Иначе
		Если СтруктураПараметров.ДляПроектирования = Истина Тогда
			ТекстУсловиеПК = "И НЕ (ОбъектыФормата.Наименование ПОДОБНО ""КлючевыеСвойства%"" ИЛИ ОбъектыФормата.Наименование ПОДОБНО ""Info%"")";
		Иначе
			ТекстУсловиеПК = "И (ОбъектыФормата.Наименование ПОДОБНО ""Справочник.%"" ИЛИ ОбъектыФормата.Наименование ПОДОБНО ""Документ.%"")";
		КонецЕсли;
	КонецЕсли;
	#Вставка
	ТекстУсловиеПК = "";
	#КонецВставки
	ТекстУсловиеВерсияФормата = "";
	Если СтруктураПараметров.ОтборПоВерсиям = Истина Тогда
		ТекстУсловиеВерсияФормата = " И (ОбъектыФормата.Владелец = &ВерсияФормата
		|								ИЛИ ОбъектыФормата.Владелец В (ВЫБРАТЬ РАЗЛИЧНЫЕ Расширение
		|									ИЗ РегистрСведений.ВзаимосвязиВерсийФорматовИРасширений
		|									ГДЕ ВерсияФорматаОбмена = &ВерсияФормата))";
	ИначеЕсли СтруктураПараметров.ОтборПоКонвертациям = Истина Тогда
		ТекстУсловиеВерсияФормата = " И (ОбъектыФормата.Владелец В (ВЫБРАТЬ ВерсияФормата ИЗ ВерсииИзКонвертаций)
		|								ИЛИ ОбъектыФормата.Владелец В (ВЫБРАТЬ ВерсияФормата ИЗ ВерсииИзРасширений))";
	КонецЕсли;

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#СОЕДИНЕНИЕ_ПК#", ТекстСоединениеПК);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#УСЛОВИЕ_ПК#", ТекстУсловиеПК);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#УсловиеВерсияФормата#", ТекстУсловиеВерсияФормата);
	Возврат ТекстЗапроса;
КонецФункции

#КонецОбласти
